ANIME_PLAYERS = {
    "Steins;Gate": {
        "player_main": "https://www.anilibria.tv/public/iframe.php?id=8674",
        "player_backup": "//aniqit.com/serial/27423/9bc813cf9293f1305ce036b03845618a/720p?translations=false",
    },
    "Steins;Gate 0": {
        "player_main": "https://www.anilibria.tv/public/iframe.php?id=6140",
        "player_backup": "//kodik.info/serial/10115/68d9f5d02225e165c1e650faecfaa3d8/720p?translations=false",
    },
}

ANIME_POSTERS = {
    "Steins;Gate": "img/poster_1.jpg",
    "Steins;Gate 0": "img/poster_2.jpg",
}

ANIME_DEFAULTS = {
    "Steins;Gate": {
        "appearing": "2011 весна",
        "type": "ТВ (25 эп.), 25 мин.",
        "genres": "Триллер, Фантастика, Научная фантастика, Тайна, Психологический хоррор, Приключение, Романтика",
        "description": (
            "В Вратах Штейна рассказывается о группе молодых студентов-технарей. "
            "Студенты находят способ менять прошлое по почте с помощью модифицированной микроволновки и начинают опыты с целью узнать, "
            "насколько далеко сможет зайти их открытие, но в итоге все начинает выходить из-под контроля, "
            "и студенты впутываются в заговор вокруг SERN — организации, стоящей за Большим адронным коллайдером — и Джона Титора, "
            "утверждающего, что он явился из антиутопичного будущего."
        ),
    },
    "Steins;Gate 0": {
        "appearing": "2018 весна",
        "type": "ТВ (24 эп.), 25 мин.",
        "genres": "Триллер, Фантастика, Научная фантастика, Тайна, Психологический хоррор, Психология, Романтика",
        "description": (
            "Альтернативная концовка Врат Штейна, "
            "в которой эгоцентричный безумный ученый Окабе Ринтаро изо всех сил старается оправиться от неудачной попытки спасти жизнь Курису Макисе. "
            "Стараясь забыть прошлое, Окабе отказывается от своего альтер-эго. И когда, казалось бы, всё наладилось, он снова сталкивается со своим прошлым. "
            "Он знакомится с девушкой, которая представилась знакомой Курису. "
            "От неё Окабе узнает, что в данный момент проходит испытание устройства, которое способно воссоздавать характер и личность человека по воспоминаниям. "
            "Начиная тестирование он и не предполагал, что воссоздание Курису принесет столько мучений и новых неожиданных последствий..."
        ),
    },
}

ANIME_QUESTIONS = [
        {"label": "Первоисточник", "url": "https://steins-gate.fandom.com/wiki/List_of_Steins;Gate_games"},
        {"label": "Мировые линии", "url": "https://steins-gate.fandom.com/wiki/World_Line"},
        {"label": "Список известных мировых линий", "url": "https://steins-gate.fandom.com/wiki/List_of_Known_World_Lines"},
        {"label": "СЕРН", "url": "https://steins-gate.fandom.com/wiki/SERN"},
        {"label": "Конвергенция мировых линий", "url": "https://steins-gate.fandom.com/wiki/World_Line_Convergence"},
        {"label": "Поля аттракторов", "url": "https://steins-gate.fandom.com/wiki/Attractor_Field"},
]